&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Команда 			= Команды.Добавить("ШкольниковСВ"); 
	Команда.Заголовок 	= "Школьников С.В.";
	Команда.Действие  	= "ШкольниковСВ";
		
	КнопкаФормы 			= Элементы.Добавить("ШкольниковСВ" , Тип("КнопкаФормы"), ЭтаФорма);	
	КнопкаФормы.ИмяКоманды 	= "ШкольниковСВ";
	КнопкаФормы.Вид 		= ВидКнопкиФормы.ОбычнаяКнопка;     
		
КонецПроцедуры  

&НаКлиенте
Процедура ШкольниковСВ(Команда)
	
	ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru='Помещение в GIT выполнено. Исполнитель Школьников С.В.'"));
	
КонецПроцедуры