
Процедура ОР_ПодпискаНаСобытиеОтсутствиеСотрудникаПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	
	Запрос = Новый Запрос;
	Если ТипЗнч(Источник) = Тип("ДокументОбъект.БольничныйЛист") Тогда
		Запрос.Текст = 
		"ВЫБРАТЬ
		//|	БольничныйЛист.Дата КАК Период,
		|	БольничныйЛист.Сотрудник КАК Сотрудник,
		|	БольничныйЛист.ДатаНачала КАК ДатаНачалаОтсутствия,
		|	БольничныйЛист.ДатаОкончания КАК ДатаОкончанияОтсутствия,
		|	РАЗНОСТЬДАТ(БольничныйЛист.ДатаНачала, БольничныйЛист.ДатаОкончания, ДЕНЬ) + 1 КАК КоличествоДней
		|ИЗ
		|	Документ.БольничныйЛист КАК БольничныйЛист
		|ГДЕ
		|	БольничныйЛист.Ссылка = &Ссылка";
		
	ИначеЕсли ТипЗнч(Источник) = Тип("ДокументОбъект.Отпуск") Тогда
		Запрос.Текст = 
		"ВЫБРАТЬ
		//|	Отпуск.Дата КАК Период,
		|	Отпуск.Сотрудник КАК Сотрудник,
		|	Отпуск.ДатаНачалаОсновногоОтпуска КАК ДатаНачалаОтсутствия,
		|	Отпуск.ДатаОкончанияОсновногоОтпуска КАК ДатаОкончанияОтсутствия,
		|	РАЗНОСТЬДАТ(Отпуск.ДатаНачалаОсновногоОтпуска, Отпуск.ДатаОкончанияОсновногоОтпуска, ДЕНЬ) + 1 КАК КоличествоДней
		|ИЗ
		|	Документ.Отпуск КАК Отпуск
		|ГДЕ
		|	Отпуск.Ссылка = &Ссылка"	
	Иначе
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Увольнение.Сотрудник КАК Сотрудник,
		|	Увольнение.ДатаУвольнения КАК ДатаНачалаОтсутствия,
		|	Увольнение.ДатаУвольнения КАК ДатаОкончанияОтсутствия
		|ИЗ
		|	Документ.Увольнение КАК Увольнение
		|ГДЕ
		|	Увольнение.Ссылка = &Ссылка"
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Ссылка", Источник.Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	МенеджерЗаписи = РегистрыСведений.ОтсутствиеСотрудникаАстон.СоздатьМенеджерЗаписи();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		//Проверяем наличие записи в регистре
		МенеджерЗаписи.Сотрудник = ВыборкаДетальныеЗаписи.Сотрудник;
		МенеджерЗаписи.ДатаНачалаОтсутствия = ВыборкаДетальныеЗаписи.ДатаНачалаОтсутствия;
		МенеджерЗаписи.ДатаОкончанияОтсутствия = ВыборкаДетальныеЗаписи.ДатаОкончанияОтсутствия;
		МенеджерЗаписи.Прочитать();
		//Если запись отсутствует - записываем
		Если НЕ МенеджерЗаписи.Выбран() Тогда
			МенеджерЗаписи.Сотрудник = ВыборкаДетальныеЗаписи.Сотрудник;
			МенеджерЗаписи.ДатаНачалаОтсутствия = ВыборкаДетальныеЗаписи.ДатаНачалаОтсутствия; 
			МенеджерЗаписи.ДатаОкончанияОтсутствия = ВыборкаДетальныеЗаписи.ДатаОкончанияОтсутствия;
			Если ТипЗнч(Источник) = Тип("ДокументОбъект.БольничныйЛист") ИЛИ ТипЗнч(Источник) = Тип("ДокументОбъект.Отпуск") Тогда
				МенеджерЗаписи.КоличествоДней = ВыборкаДетальныеЗаписи.КоличествоДней;
			Иначе
				МенеджерЗаписи.КоличествоДней = 0;
			КонецЕсли;	
			МенеджерЗаписи.Записать(Ложь);
		//Если запись есть - пропускаем	
		Иначе 
			Продолжить;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры
