
Процедура ДвиженияОтсутствийСотрудниковОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт
	ДвиженияОтсутствий = Источник.Движения.ОтсутствиеСотрудникаАстон;
	ДвиженияОтсутствий.Записывать = Истина;
	
		Движения = ДвиженияОтсутствий.Добавить();
		Движения.Сотрудник = Источник.Сотрудник;
		Если ТипЗнч(Источник) = Тип("ДокументОбъект.БольничныйЛист") Тогда
			 Движения.ДатаНачалаОтсутствия = Источник.ДатаНачала;
			 Движения.ДатаОкончанияОтсутствия = Источник.ДатаОкончания;
			 Движения.КоличествоДней = (Источник.ДатаОкончания -  Источник.ДатаНачала) / 86400;
		 ИначеЕсли ТипЗнч(Источник) = Тип("ДокументОбъект.Отпуск") тогда
			 Движения.ДатаНачалаОтсутствия = Источник.ДатаНачалаОсновногоОтпуска;
			 Движения.ДатаОкончанияОтсутствия = Источник.ДатаОкончанияОсновногоОтпуска;
			 Движения.КоличествоДней = (Источник.ДатаОкончанияОсновногоОтпуска - Источник.ДатаНачалаОсновногоОтпуска) / 86400;
		 ИначеЕсли ТипЗнч(Источник) = Тип("ДокументОбъект.Увольнение") Тогда 
			 Движения.ДатаНачалаОтсутствия = Источник.ДатаУвольнения; 
			 Движения.КоличествоДней = 0;
		КонецЕсли;

КонецПроцедуры
