&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Команда 			= Команды.Добавить("КутняковВ"); 
	Команда.Заголовок 	= "Кутняков В.";
	Команда.Действие  	= "КутняковВ";
		
	КнопкаФормы 			= Элементы.Добавить("КутняковВ" , Тип("КнопкаФормы"), ЭтаФорма);	
	КнопкаФормы.ИмяКоманды 	= "КутняковВ";
	КнопкаФормы.Вид 		= ВидКнопкиФормы.ОбычнаяКнопка;     
		
КонецПроцедуры  

&НаКлиенте
Процедура КомандаДляПримера(Команда)
	
	ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru='Помещение в GIT выполнено. Исполнитель Кутняков В.'"));
	
КонецПроцедуры