
Процедура Расш1_ПодпискаДокументыОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт
	ДвижениеРС = Источник.Движения.Расш1_ОтсутствиеСотрудникаАстон;
	ДвижениеРС.Записывать = Истина ;

	Если ТипЗнч(Источник) = Тип("ДокументОбъект.Отпуск") Тогда
		Движение = ДвижениеРС.Добавить();
		Движение.Сотрудник = Источник.Сотрудник;
		Движение.ДатаНачалаОтсутствия  		= Источник.ДатаНачалаОсновногоОтпуска;
		Движение.ДатаОкончанияОтсутствия 	= Источник.ДатаОкончанияОсновногоОтпуска;
	    Движение.КоличествоДней 			=(Источник.ДатаОкончанияОсновногоОтпуска - Источник.ДатаНачалаОсновногоОтпуска + 86400) /86400;
	ИначеЕсли ТипЗнч(Источник) = Тип("ДокументОбъект.БольничныйЛист") Тогда
		Движение = ДвижениеРС.Добавить();
		Движение.Сотрудник = Источник.Сотрудник;
		Движение.ДатаНачалаОтсутствия	=Источник.ДатаНачала;
		Движение.ДатаОкончанияОтсутствия=Источник.ДатаОкончания;
		Движение.КоличествоДней			=(Источник.ДатаОкончания - Источник.ДатаНачала + 86400) /86400;
	ИначеЕсли ТипЗнч(Источник) = Тип("ДокументОбъект.Увольнение") Тогда
		Движение = ДвижениеРС.Добавить();
		Движение.Сотрудник = Источник.Сотрудник;
		Движение.ДатаНачалаОтсутствия		=Источник.ДатаУвольнения;
		Движение.ДатаОкончанияОтсутствия	=Источник.ДатаУвольнения;
		Движение.КоличествоДней				=0;
	КонецЕсли;
КонецПроцедуры
