&НаСервере
Процедура ПолучениеКурсаВалют()
	Перем ДатаКурса, НаименованиеВалюты, ОписаниеВалюты, КурсВалюты;
	Сервер = "api.coindesk.com";
	Порт = 443;
	Пользователь = "";
	Пароль = "";
	Прокси = Неопределено;
	Таймаут = 30;
	
	ЗащищенноеСоединение = Новый ЗащищенноеСоединениеOpenSSL();
	
	Соединение = Новый HTTPСоединение(Сервер, Порт, Пользователь, Пароль, Прокси, Таймаут, ЗащищенноеСоединение);
	
	АдресРесурса = "v1/bpi/currentprice.json";
	HTTPзапрос = Новый HTTPЗапрос(АдресРесурса);
	HTTPответ = Соединение.ВызватьHTTPМетод("GET", HTTPзапрос); 
	Сообщение = Новый СообщениеПользователю;
	
	
	
	Если HTTPответ.КодСостояния = 200 Тогда
		Чтение = Новый ЧтениеJSON;
		Чтение.ОткрытьПоток(HTTPответ.ПолучитьТелоКакПоток());
		Данные = ПрочитатьJSON(Чтение,,,ФорматДатыJSON.ISO);
		Для каждого Стр Из Данные.bpi Цикл
			
			Если  Справочники.Валюты.НайтиПоНаименованию(Стр.Значение.code) <> Справочники.Валюты.ПустаяСсылка()Тогда
				НовыйЭлементРС = РегистрыСведений.КурсыВалют.СоздатьМенеджерЗаписи();
				НовыйЭлементРС.Период = ПрочитатьДатуJSON(Данные.time.updatedISO,ФорматДатыJSON.ISO);
				НовыйЭлементРС.Валюта = Справочники.Валюты.НайтиПоНаименованию(Стр.Значение.code); 
				НовыйЭлементРС.Курс = Стр.Значение.rate_float; 
				НовыйЭлементРС.Кратность = 1;
				НовыйЭлементРС.Записать();	
				
			КонецЕсли;
			
			
			
		КонецЦикла;
		
	Иначе
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не удалось выполнить запрос.
		|Код состояния: " + HTTPответ.КодСостояния + "
		|Тело ответа: " + HTTPответ.ПолучитьТелоКакСтроку();
		Сообщение.Сообщить();
		
	КонецЕсли; 
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьКурс(Команда)
	
	ПолучениеКурсаВалют();
	
КонецПроцедуры
