&НаСервере
Процедура ПолучениеКурсаВалют()
	Перем ДатаКурса, НаименованиеВалюты, ОписаниеВалюты, КурсВалюты;
	Сервер = "api.coindesk.com";
	Порт = 443;
	Пользователь = "";
	Пароль = "";
	Прокси = Неопределено;
	Таймаут = 5;
	
	ЗащищенноеСоединение = Новый ЗащищенноеСоединениеOpenSSL();
	
	Соединение = Новый HTTPСоединение(Сервер, Порт, Пользователь, Пароль, Прокси, Таймаут, ЗащищенноеСоединение);
	
	АдресРесурса = "v1/bpi/currentprice.json";
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Content-Type", "application/json; charset=utf-8");
	Заголовки.Вставить("Connection", "keep-alive");
	HTTPзапрос = Новый HTTPЗапрос(АдресРесурса, Заголовки);
	HTTPответ = Соединение.ВызватьHTTPМетод("GET", HTTPзапрос);
	КодыОтветов = Новый Соответствие;
	КодыОтветов.Вставить(200,"Все ОК");
	КодыОтветов.Вставить(301,"URL-адрес запрошенного ресурса был изменен навсегда");
	КодыОтветов.Вставить(401, "Пользователь не авторизован");
	КодыОтветов.Вставить(403, "Клиент не имеет прав доступа к контенту");
	КодыОтветов.Вставить(404, "Сервер не может найти запрошенный ресурс");
	КодыОтветов.Вставить(500, "На сервере произошла ошибка");
	КодыОтветов.Вставить(502, "Недопустимый ответ от целевого сервера");
	КодыОтветов.Вставить(503, "Сервер не готов обработать запрос в данный момент");
	КодОтвета = КодыОтветов.Получить(HTTPответ.КодСостояния);
	
	Если HTTPответ.КодСостояния = 200 Тогда
		СообщениеДляПользователя = СтрШаблон("Удалось выполнить запрос.
		|Код состояния: %1
		|Описание кода: %2", HTTPответ.КодСостояния, КодОтвета); 
		ОбщегоНазначения.СообщитьПользователю(СообщениеДляПользователя);
		Чтение = Новый ЧтениеJSON;
		Чтение.ОткрытьПоток(HTTPответ.ПолучитьТелоКакПоток());
		Данные = ПрочитатьJSON(Чтение,,,ФорматДатыJSON.ISO);
		НаборЗаписей = РегистрыСведений.КурсыВалют.СоздатьНаборЗаписей();
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Валюты.Ссылка КАК Ссылка,
		|	Валюты.Наименование КАК Наименование
		|ИЗ
		|	Справочник.Валюты КАК Валюты";
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Для каждого Стр Из Данные.bpi Цикл	
				Если ВыборкаДетальныеЗаписи.Наименование = Стр.Значение.code Тогда
					
					НовыйЭлементРС = НаборЗаписей.Добавить();
					НовыйЭлементРС.Период = ПрочитатьДатуJSON(Данные.time.updatedISO, ФорматДатыJSON.ISO);
					НовыйЭлементРС.Валюта = ВыборкаДетальныеЗаписи.Ссылка; 
					НовыйЭлементРС.Курс = Стр.Значение.rate_float; 
					НовыйЭлементРС.Кратность = 1;	
					
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЦикла;  
		
		НаборЗаписей.Записать(РежимЗамещения.Слияние);
		
	Иначе
		
		СообщениеДляПользователя = СтрШаблон("Не удалось выполнить запрос.
		|Код состояния: %1
		|Описание ошибки: %2", HTTPответ.КодСостояния, КодОтвета); 
		ОбщегоНазначения.СообщитьПользователю(СообщениеДляПользователя);
		
	КонецЕсли; 
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьКурс(Команда)
	
	ПолучениеКурсаВалют();
	
КонецПроцедуры
