
Процедура ШСВ_ПодпискаНаСобытиеОтсутствиеРаботникаОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт
	// Вставить содержимое обработчика.
	Док = Источник; 
    НаборЗаписей = Док.Движения.ШСВ_ОтсутствиеСотрудникаАстон; 
	НаборЗаписей.Записывать = Истина;
	Если ТипЗнч(Док) = Тип("ДокументОбъект.БольничныйЛист") Тогда
		
		НовыйЭлементРС = НаборЗаписей.Добавить();
		НовыйЭлементРС.Сотрудник = Источник.Сотрудник;
		НовыйЭлементРС.ДатаНачалаОтсутствия = Источник.ДатаНачала;
		НовыйЭлементРС.ДатаОкончанияОтсутствия = Источник.ДатаОкончания;
		НовыйЭлементРС.КоличествоДней = (НовыйЭлементРС.ДатаОкончанияОтсутствия - НовыйЭлементРС.ДатаНачалаОтсутствия) / 86400 + 1; 
				
		
	ИначеЕсли ТипЗнч(Док) = Тип("ДокументОбъект.Отпуск") Тогда
		НовыйЭлементРС = НаборЗаписей.Добавить();
		НовыйЭлементРС.Сотрудник = Источник.Сотрудник;
		НовыйЭлементРС.ДатаНачалаОтсутствия = Источник.ДатаНачалаОсновногоОтпуска;
		НовыйЭлементРС.ДатаОкончанияОтсутствия = Источник.ДатаОкончанияОсновногоОтпуска;
		НовыйЭлементРС.КоличествоДней = Источник.КоличествоДнейОсновногоОтпуска;
		
		
	Иначе
		
		НовыйЭлементРС = НаборЗаписей.Добавить();
		НовыйЭлементРС.Сотрудник = Источник.Сотрудник;
		НовыйЭлементРС.ДатаНачалаОтсутствия = Источник.ДатаУвольнения;
		НовыйЭлементРС.ДатаОкончанияОтсутствия = Источник.ДатаУвольнения;
		НовыйЭлементРС.КоличествоДней = 0;
				
	КонецЕсли;
	
КонецПроцедуры
