
&НаСервере
Процедура ПолучитьКурсыВалютНаСервере()
	
	//https://api.coindesk.com/v1/bpi/currentprice.json
	
	ЗащищенноеСоединение = Новый ЗащищенноеСоединениеOpenSSL;
	HTTPСоединение = Новый HTTPСоединение("api.coindesk.com",,,,, 30, ЗащищенноеСоединение,);
	
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("updated"); 
	
	HTTPЗапрос = Новый HTTPЗапрос("/v1/bpi/currentprice.json", Заголовки);
	
	//Ответ = Соединение.ВызватьHTTPМетод("GET", Запрос);
	
	//Если Ответ.КодСостояния = 200 Тогда
	
	Ответ = HTTPСоединение.Получить(HTTPЗапрос);
	
	Результат = Ответ.ПолучитьТелоКакСтроку();
	
	
	//ТелоОтвета = Ответ.ПолучитьТелоКакПоток(); 
	//
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(Результат);
	//ЧтениеJSON.ОткрытьПоток(Ответ); 
	Пока ЧтениеJSON.Прочитать() Цикл
		
		ТипJSON = ЧтениеJSON.ТипТекущегоЗначения;
		//ЗначениеJSON = ЧтениеJSON.ТекущееЗначение;
		
		Если ТипJSON = ТипЗначенияJSON.ИмяСвойства Тогда
			ИмяТекущегоСвойства = ЧтениеJSON.ТекущееЗначение;
		ИначеЕсли ТипJSON = ТипЗначенияJSON.Строка Тогда
			ТекущееЗначение = ЧтениеJSON.ТекущееЗначение;
			Если ИмяТекущегоСвойства = "updated" Тогда
				Период = ТекущееЗначение;
			ИначеЕсли ИмяТекущегоСвойства = "code" Тогда 
				Валюта = ТекущееЗначение;
			ИначеЕсли ИмяТекущегоСвойства = "rate" Тогда  
				Курс = ТекущееЗначение;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	//МассивДанных = ПрочитатьJSON(ЧтениеJSON, Истина);
	//Иначе
	
	//	 Сообщение = Новый СообщениеПользователю;
	//	 Сообщение.Текст = СтрШаблон("Не удалось выполнить запрос, код состояния: %1, ответ сервера: %2", Ответ.КодСостояния, Ответ.ПолучитьТелоКакСтроку());
	//	 Сообщение.Сообщить();
	//
	//КонецЕсли;
	//
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьКурсыВалют(Команда)
	ПолучитьКурсыВалютНаСервере();
КонецПроцедуры
