&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Команда 			= Команды.Добавить("ШкольникоСВ"); 
	Команда.Заголовок 	= "Школьников С. В.";
	Команда.Действие  	= "КомандаОбщая";
		
	КнопкаФормы 			= Элементы.Добавить("ШкольникоСВ" , Тип("КнопкаФормы"), ЭтаФорма);	
	КнопкаФормы.ИмяКоманды 	= "ШкольникоСВ";
	КнопкаФормы.Вид 		= ВидКнопкиФормы.ОбычнаяКнопка;   
	
	Команда 			= Команды.Добавить("БубаревАВ"); 
	Команда.Заголовок 	= "Бубарев А. В.";
	Команда.Действие  	= "КомандаОбщая";
		
	КнопкаФормы 			= Элементы.Добавить("БубаревАВ" , Тип("КнопкаФормы"), ЭтаФорма);	
	КнопкаФормы.ИмяКоманды 	= "БубаревАВ";
	КнопкаФормы.Вид 		= ВидКнопкиФормы.ОбычнаяКнопка;    
	
	Команда 			= Команды.Добавить("КорневЮА"); 
	Команда.Заголовок 	= "Корнев Ю. А.";
	Команда.Действие  	= "КомандаОбщая";
		
	КнопкаФормы 			= Элементы.Добавить("КорневЮА" , Тип("КнопкаФормы"), ЭтаФорма);	
	КнопкаФормы.ИмяКоманды 	= "КорневЮА";
	КнопкаФормы.Вид 		= ВидКнопкиФормы.ОбычнаяКнопка;    
		
КонецПроцедуры  

&НаКлиенте
Процедура КомандаОбщая(Команда)
	Исполнитель = "ru='Помещение в GIT выполнено. Исполнитель " + Команда.Имя + "'";
	ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр(Исполнитель));
	
КонецПроцедуры