&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Команда 			= Команды.Добавить("КомандаДляПримера"); 
	Команда.Заголовок 	= "Команда для примера";
	Команда.Действие  	= "КомандаДляПримера";
		
	КнопкаФормы 			= Элементы.Добавить("КомандаДляПримера" , Тип("КнопкаФормы"), ЭтаФорма);	
	КнопкаФормы.ИмяКоманды 	= "КомандаДляПримера";
	КнопкаФормы.Вид 		= ВидКнопкиФормы.ОбычнаяКнопка; 
	
	НоваяКоманда = Команды.Добавить("НекрасоваЕВ");
	НоваяКоманда.Заголовок = "Некрасова Е.В.";
	НоваяКоманда.Действие = "НекрасоваЕВ"; 
	
	КнопкаФормы 			= Элементы.Добавить("НекрасоваЕВ", Тип("КнопкаФормы"), ЭтаФорма);
	КнопкаФормы.ИмяКоманды = "НекрасоваЕВ";
	КнопкаФормы.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
		
КонецПроцедуры  

&НаКлиенте
Процедура КомандаДляПримера(Команда)
	
	ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru='Помещение в GIT выполнено. Исполнитель Попов А.В.'"));
	
КонецПроцедуры   

&НаКлиенте
Процедура НекрасоваЕВ(НоваяКоманда)
	
	ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru='Помещение в GIT выполнено. Исполнитель Некрасова Е.В.'"));
	
КонецПроцедуры