
&НаКлиенте
Процедура ЗагрузитьКурс(Команда)
	
	НТТРСоединение = Новый HTTPСоединение("api.coindesk.com");
	
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Content-Type", "application/json");
	Попытка
		HTTPЗапрос = Новый HTTPЗапрос("/v1/bpi/currentprice.json", Заголовки); 
		Результат = НТТРСоединение.Получить(HTTPЗапрос);
		Ответ = Результат.ПолучитьТелоКакСтроку();
	Исключение
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = ОписаниеОшибки();
		Сообщение.Сообщить();
		Возврат;
	КонецПопытки;
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(Ответ);
	ДанныеДляЗаписи = ПрочитатьJSON(ЧтениеJSON);   
	ЧтениеJSON.Закрыть(); 
	Массив = Новый Массив;
	Для Каждого Строка из ДанныеДляЗаписи.bpi Цикл 
		Массив.Добавить(Строка);
	КонецЦикла;
	ЗаписатьДанные(Массив, ДанныеДляЗаписи.time);


КонецПроцедуры

&НаСервере
Процедура ЗаписатьДанные(Данные, Дата) 
	НаборЗаписей = РегистрыСведений.КурсыВалют.СоздатьНаборЗаписей();
	Для Каждого Строка Из Данные цикл 
		
		НоваяЗапись = НаборЗаписей.Добавить(); 
		НоваяЗапись.Период =  XMLЗначение(Тип("Дата"),Дата.updatedISO);  
		Валюта = Справочники.Валюты.НайтиПоНаименованию(Строка.Значение.code);
		Если НЕ ЗначениеЗаполнено(Валюта) тогда 
			НоваяВалюта = Справочники.Валюты.СоздатьЭлемент();
			НоваяВалюта.Код = Строка.Значение.code;
			НоваяВалюта.Наименование = Строка.Значение.code;
			НоваяВалюта.НаименованиеПолное = Строка.Значение.code;
			НоваяВалюта.Записать(); 
			Валюта = НоваяВалюта.Ссылка;
		КонецЕсли;
		НоваяЗапись.Валюта = Валюта;
		НоваяЗапись.Курс = Строка.Значение.rate_float; 
		НоваяЗапись.Кратность = 1;
	КонецЦикла;
	НаборЗаписей.Записать();
	
	
	//НаборЗаписей.Записать(); 
	

КонецПроцедуры
