
//&После("ОбработкаПроведения")
//Процедура НСМ1_ОбработкаПроведения(Отказ, РежимПроведения)
//	Движения.НСМ1_ОстаткиНоменклатуры.Записывать = Истина;
//	Для Каждого ТекСтрокаТовар Из Товары Цикл
//		Движение = Движения.НСМ1_ОстаткиНоменклатуры.Добавить();
//		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
//		Движение.Период = Дата;
//		Движение.Номенкулатура = ТекСтрокаТовар.Номенклатура;
//		Движение.Организация = Организация;
//		Движение.Склад = Склад ;
//		Движение.Количество = ТекСтрокаТовар.Количество ;
//	КонецЦикла;
//КонецПроцедуры
