//&После ("ПриСозданииНаСервере")
//&НаСервере
//Процедура Расш1_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
//	НовыйРеквизит = Новый РеквизитФормы("МетодПроведения", Новый ОписаниеТипов("Число"),,"ВариантыВыбора");
//	ДобавляемыеРеквизиты = новый Массив;
//	ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);
//   
//	ИзменитьРеквизиты(ДобавляемыеРеквизиты);
//	НовыйЭлемент = Элементы.Добавить("ПолеВариант",Тип("ПолеФормы"),ЭтаФорма);
//	НовыйЭлемент.ПутьКДанным="МетодПроведения";
//	НовыйЭлемент.Вид = ВидПоляФормы.ПолеПереключателя;
//	НовыйЭлемент.КоличествоКолонок = 2;
//	НовыйЭлемент.СписокВыбора.добавить(1,"Новая");
//	НовыйЭлемент.СписокВыбора.добавить(2,"Старая");
//КонецПроцедуры
